--[[ LuaDUM menus: Russian ]]--
--[[ LuaDUM--меню: русский ]]--

--------------------------------------------------------------------------------
local Data = {

  -- basic
  Separator         = "Разделитель",

  MainMenu          = "LUM для Диалога",

  ----------------------------------------
  -- Template Insert:
  TemplateInsert    = "Вставка шаблона",
  TplInsItem        = "&J - Вставка шаблона",
  ExtensionInsert   = "Вставка расширения",
  ExtInsItem        = "&I - Вставка расширения",
  LanguageInsert    = "Вставка кода языка",
  LngInsItem        = "&L - Вставка кода языка",

  ----------------------------------------

  ----------------------------------------

  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
