--[[ LuaDUM menus: Russian ]]--
--[[ LuaDUM--меню: русский ]]--

--------------------------------------------------------------------------------
local Data = {

  -- basic
  Separator         = "Разделитель",

  MainMenu          = "LUM для Диалога",

  ----------------------------------------
  -- Template Insert:
  TemplateInsert    = "Вставка шаблона",
  TplInsItem        = "&J - Вставка шаблона",

  ----------------------------------------

  ----------------------------------------

  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
