--[[ Date+Time: Russian ]]--
--[[ Дата+Время: русский ]]--

--------------------------------------------------------------------------------
local Data = {
  ----------------------------------------
  Calendar = "Календарь",

  --
  Date              = "Дата",
  Time              = "Время",

  --[[
  PrevYear          = "◀",
  NextYear          = "▶",
  PrevMonth         = "◄",
  NextMonth         = "►",

  Dec_Date          = "−",
  Inc_Date          = "+",
  --]]

  --
  InputDate         = "Введите дату",
  InputTime         = "Введите время",

  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
