--[[ Date+Time: Russian ]]--
--[[ Дата+Время: русский ]]--

--------------------------------------------------------------------------------
local Data = {
  ----------------------------------------
  Calendar = "Календарь",

  --
  Date              = "Дата",
  Time              = "Время",

  --
  InputDate         = "Введите дату",
  InputTime         = "Введите время",

  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
