--[[ Date+Time: Russian ]]--
--[[ Дата+Время: русский ]]--

--------------------------------------------------------------------------------
local Data = {
  -- Dialog items texts.
  btn_Ok     = "Ок",
  btn_Close  = "Закрыть",
  btn_Cancel = "Отмена",

  ----------------------------------------
  Calendar = "Календарь",

  --
  Date              = "Дата",
  Time              = "Время",

  ----------------------------------------

  ----------------------------------------
  Terra = {
    Name = "Земля",
    ["Type.Gregorean"] = "Григорианский календарь",

    WeekDay = {
      n = 3,
      [0] = {
        [0] = "Воскресенье",
        "Понедельник", "Вторник", "Среда",
        "Четверг", "Пятница", "Суббота",
      },
      --[[
      [1] = {
        [0] = "0",
        "1", "2", "3",
        "4", "5", "6",
      },
      --]]
      [2] = {
        [0] = "ВС",
        "ПН", "ВТ", "СР",
        "ЧТ", "ПТ", "СБ",
      },
      [3] = {
        [0] = "Вос",
        "Пон", "Втр", "Срд",
        "Чет", "Пят", "Суб",
      },
    }, -- WeekDay

    ----------------------------------------
    YearMonth = {
      n = 3,
      [0] = {
        "Январь",     "Февраль",      "Март",
        "Апрель",     "Май",          "Июнь",
        "Июль",       "Август",       "Сентябрь",
        "Октябрь",    "Ноябрь",       "Декабрь",
      },
      --[[
      [1] = {
        "1", "2", "3",
        "4", "5", "6",
        "7", "8", "9",
        "°", "¹", "²",
        --"@", "#", "§",
      },
      --]]
      [2] = {
        "Ян", "Фв", "Мр",
        "Ап", "Мй", "Ин",
        "Ил", "Ав", "Се",
        "Ок", "Нб", "Де",
      },
      [3] = {
        "Янв", "Фев", "Мар",
        "Апр", "Май", "Июн",
        "Июл", "Авг", "Сен",
        "Окт", "Ноя", "Дек",
      },
    }, -- YearMonth

  }, -- Terra
  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
