--[[ LuaEUM menus: Russian ]]--
--[[ LuaEUM--меню: русский ]]--

--------------------------------------------------------------------------------
local Data = {
  -- basic
  Separator         = "Separator",

  ----------------------------------------
  Subtitles         = "&Q - Субтитры",

  SubtitleType      = "&Y - Тип файла субтитров",
    SubtitleTypeName    = "Тип файла субтитров",
    SubtitleUnknownType = "Неизвестный тип файла субтитров",

  TimeCalcer        = "&Q - Калькулятор времени",

  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
