--[[ Date+Time: Russian ]]--
--[[ Дата+Время: русский ]]--

--------------------------------------------------------------------------------
local Data = {
  ----------------------------------------
  -- Common fests:
  NewYear                   = "Новый год", -- Н.г.
  SaintValentineDay         = "День святого Валентина",
  FatherlandDayDefender     = "День защитника Отечества",
  InternationalWomensDay    = "Международный женский день",
  AllFoolsDay               = "День дурака", -- День смеха
  InterAnimationDay         = "Международный день анимации",
  InternationalMensDay      = "Международный мужской день",
  NewYearsEve               = "Канун Нового года",

  -- Special days:
  GPW_VictoryDay            = "День Победы",
    -- Начало Великой Отечественной войны
  GPW_MemorialDay           = "День памяти и скорби",
    -- День принятия ГосДумой закона о реформировании РАН,
    -- подписан В.В. Путиным 2013-09-27, автор дня — А. Невзоров
  RussiaObscurantismDay     = "День мракобесия в России",

  -- Professional days:
    -- Всемирный день авиации и космонавтики
    -- Международный день полёта человека в космос
  WorldCosmonauticsDay      = "День космонавтики",
  SystemAdminsDay           = "День системного администратора",
  ProgrammersDay            = "День программиста",
    -- День воспитателя и всех дошкольных работников
  UpbringersDay             = "День воспитателя",
    -- "Всемирный день учителей"
  WorldTeachersDay          = "День учителя",
  InterAccountantsDay       = "Международный день бухгалтера",
  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
