--[[ Date+Time: Russian ]]--
--[[ Дата+Время: русский ]]--

--------------------------------------------------------------------------------
local Data = {
  ----------------------------------------
  VictoryDay                = "День Победы",
  GreatPatrioticWarStart    = "Начало Великой Отечественной войны",

  SaintValentineDay         = "День святого Валентина",
  FatherlandDayDefender     = "День защитника Отечества",
  InternationalMensDay      = "Международный мужской день",
  InternationalWomensDay    = "Международный женский день",

  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
