--[[ Transcript: Russian ]]--
--[[ Транскрибирование: русский ]]--

--------------------------------------------------------------------------------
local Data = {
  -- basic
  Separator         = "Разделитель",

  ----------------------------------------
  ChangeSign      = "&Q - Изменение символов",
      SignTyper     = "&Q - Типографика",
      SignMaths     = "&M - Математика",
      SignSuper     = "&= - Верхний индекс",
      SignSuber     = "&- - Нижний индекс",
      SignRefer     = "&0 - Ссылка-сноска",

  ChangeChar      = "&X - Транскрибирование",
    CharChar      = "Транслитерация",
      CharLatRus    = "Lat -> Rus",
      CharRusLat    = "Rus -> Lat",
    CharGraf      = "Трансграфика",
      GrafLatRus    = "Lat -> Rus",
      GrafRusLat    = "Rus -> Lat",

  ----------------------------------------
} --- Data

return Data
--------------------------------------------------------------------------------
