--[[ LiterChangeSets ]]--

----------------------------------------
--[[ description:
  -- Наборы изменений для букв.
  -- Change sets for letters.
--]]
--------------------------------------------------------------------------------

----------------------------------------
--local context = context
local logShow = context.ShowInfo

local strings = require 'context.utils.useStrings'

--------------------------------------------------------------------------------
local unit = {}

---------------------------------------- Data

---------------------------------------- ---- Char: Latin <-> Rus
unit.CharLatinRus = {
  -- [[DO]]

  ['A'] = 'А',
  ['B'] = 'Б',
  ['C'] = 'Ц',
  ['D'] = 'Д',
  ['E'] = 'Э',
  ['F'] = 'Ф',
  ['G'] = 'Г',
  ['H'] = 'Х',
  ['I'] = 'И',
  ['J'] = 'Й',
  ['K'] = 'К',
  ['L'] = 'Л',
  ['M'] = 'М',
  ['N'] = 'Н',
  ['O'] = 'О',
  ['P'] = 'П',
  ['Q'] = 'Кв',
  ['R'] = 'Р',
  ['S'] = 'С',
  ['T'] = 'Т',
  ['U'] = 'У',
  ['V'] = 'В',
  ['W'] = 'В',
  ['X'] = 'Кс',
  ['Y'] = 'Ы',
  ['Z'] = 'З',

  ['KH'] = 'Х', ['Kh'] = 'Х',
  ['YA'] = 'Я', ['Ya'] = 'Я',
  ['YE'] = 'Е', ['Ye'] = 'Е',
  ['YI'] = 'И', ['Yi'] = 'И',
  ['YO'] = 'Ё', ['Yo'] = 'Ё',
  ['YU'] = 'Ю', ['Yu'] = 'Ю',

  -- [[END]]

} -- CharLatinRus

unit.CharRusLatin = {
  -- [[DO]]

  ['А'] = 'A',
  ['Б'] = 'B',
  ['В'] = 'V',
  ['Г'] = 'G',
  ['Д'] = 'D',
  ['Е'] = 'Ye',
  ['Ё'] = 'Yo',
  ['Ж'] = 'J',
  ['З'] = 'Z',
  ['И'] = 'I',
  ['Й'] = 'J',
  ['К'] = 'K',
  ['Л'] = 'L',
  ['М'] = 'M',
  ['Н'] = 'N',
  ['О'] = 'O',
  ['П'] = 'P',
  ['Р'] = 'R',
  ['С'] = 'S',
  ['Т'] = 'T',
  ['У'] = 'U',
  ['Ф'] = 'F',
  ['Х'] = 'H',
  ['Ц'] = 'C',
  ['Ч'] = 'Ch',
  ['Ш'] = 'Sh',
  ['Щ'] = 'Xh',
  ['Ъ'] = '\'',
  ['Ы'] = 'Y',
  ['Ь'] = '\'',
  ['Э'] = 'E',
  ['Ю'] = 'Yu',
  ['Я'] = 'Ya',

  -- [[END]]

} -- CharRusLatin

---------------------------------------- Char: Latin <-> Greek
unit.CharLatinGreek = {
  -- [[DO]]

  ['A'] = 'Α',
  ['B'] = 'Β',
  ['C'] = 'Χ',
  ['D'] = 'Δ',
  ['E'] = 'Ε',
  ['F'] = 'Φ',
  ['G'] = 'Γ',
  ['H'] = 'Η',
  ['I'] = 'Ι',
  ['J'] = 'ϑ',
  ['K'] = 'Κ',
  ['L'] = 'Λ',
  ['M'] = 'Μ',
  ['N'] = 'Ν',
  ['O'] = 'Ο',
  ['P'] = 'Π',
  ['Q'] = 'Θ',
  ['R'] = 'Ρ',
  ['S'] = 'Σ',
  ['T'] = 'Τ',
  ['U'] = 'Υ',
  ['V'] = 'ϐ',
  ['W'] = 'Ω',
  ['X'] = 'Ξ',
  ['Y'] = 'Ψ',
  ['Z'] = 'Ζ',

  ['v'] = 'ϖ',

  -- [[END]]

} -- CharLatinGreek

unit.CharGreekLatin = {
  -- [[DO]]

  ['Α'] = 'A',
  ['Β'] = 'B',
  ['Χ'] = 'C',
  ['Δ'] = 'D',
  ['Ε'] = 'E',
  ['Φ'] = 'F',
  ['Γ'] = 'G',
  ['Η'] = 'H',
  ['Ι'] = 'I',
  ['ϑ'] = 'J',
  ['Κ'] = 'K',
  ['Λ'] = 'L',
  ['Μ'] = 'M',
  ['Ν'] = 'N',
  ['Ο'] = 'O',
  ['Π'] = 'P',
  ['Θ'] = 'Q',
  ['Ρ'] = 'R',
  ['Σ'] = 'S',
  ['Τ'] = 'T',
  ['Υ'] = 'U',
  ['ϐ'] = 'V',
  ['Ω'] = 'W',
  ['Ξ'] = 'X',
  ['Ψ'] = 'Y',
  ['Ζ'] = 'Z',

  ['ϖ'] = 'v',

  -- [[END]]

} -- CharGreekLatin

---------------------------------------- Char: Exploro <-> Rus
unit.CharExploroRus = {
  -- [[DO]]

  ['A'] = 'А',
  ['B'] = 'Б',
  ['C'] = 'Ц',
  ['D'] = 'Д',
  ['E'] = 'Э',
  ['F'] = 'Ф',
  ['G'] = 'Г',
  --['H'] = 'Һ',
  ['H'] = 'Х',
  --['I'] = 'И',
  ['I'] = 'Ы',
  ['J'] = 'Ь',
  ['K'] = 'К',
  ['L'] = 'Л',
  ['M'] = 'М',
  ['N'] = 'Н',
  ['O'] = 'О',
  ['P'] = 'П',
  ['Q'] = 'Ж',
  ['R'] = 'Р',
  ['S'] = 'С',
  ['T'] = 'Т',
  ['U'] = 'У',
  ['V'] = 'В',
  --['W'] = 'Ӡ',
  ['W'] = 'ДЗ',
  ['X'] = 'Ш',
  ['Y'] = 'Й',
  ['Z'] = 'З',

  --['KH'] = 'Х', ['Kh'] = 'Х',
  ['YA'] = 'Я', ['Ya'] = 'Я',
  ['YE'] = 'Е', ['Ye'] = 'Е',
  ['YI'] = 'И', ['Yi'] = 'И',
  ['YO'] = 'Ё', ['Yo'] = 'Ё',
  ['YU'] = 'Ю', ['Yu'] = 'Ю',

  ['CJ'] = 'Ч', ['Cj'] = 'Ч',
  ['IJ'] = 'И', ['Ij'] = 'И',
  ['XJ'] = 'Щ', ['Xj'] = 'Щ',
  
  -- [[END]]

} -- CharExploroRus

unit.CharRusExploro = {
  -- [[DO]]

  ['А'] = 'A',
  ['Б'] = 'B',
  ['В'] = 'V',
  ['Г'] = 'G',
  ['Д'] = 'D',
  ['Е'] = 'Ye',
  ['Ё'] = 'Yo',
  ['Ж'] = 'Q',
  ['З'] = 'Z',
  --['И'] = 'I',
  ['И'] = 'Ij',
  ['Й'] = 'Y',
  ['К'] = 'K',
  ['Л'] = 'L',
  ['М'] = 'M',
  ['Н'] = 'N',
  ['О'] = 'O',
  ['П'] = 'P',
  ['Р'] = 'R',
  ['С'] = 'S',
  ['Т'] = 'T',
  ['У'] = 'U',
  ['Ф'] = 'F',
  ['Х'] = 'H',
  --['Х'] = 'Kh',
  ['Ц'] = 'C',
  ['Ч'] = 'Cj',
  ['Ш'] = 'X',
  ['Щ'] = 'Xj',
  ['Ъ'] = '\'',
  ['Ы'] = 'I',
  ['Ь'] = '\'',
  ['Э'] = 'E',
  ['Ю'] = 'Yu',
  ['Я'] = 'Ya',

  -- [[END]]

} -- CharRusExploro

---------------------------------------- Graf: Latin <-> Rus
unit.GrafLatinRus = {
  -- [[DO]]

  ['1'] = 'Т',  ['2'] = '2',
  ['3'] = 'З',  ['4'] = 'Ч',
  ['5'] = 'Б',  ['6'] = 'б',
  ['7'] = 'Т',  ['8'] = 'В',
  ['9'] = 'Э',  ['0'] = 'О',
  ['A'] = 'А',  ['a'] = 'а',
  ['B'] = 'В',  ['b'] = 'ь',
  ['C'] = 'С',  ['c'] = 'с',
  ['D'] = 'О',  ['d'] = 'о',
  ['E'] = 'Е',  ['e'] = 'е',
  ['F'] = 'Т',  ['f'] = 'т',
  ['G'] = 'Б',  ['g'] = 'ф',
  ['H'] = 'Н',  ['h'] = 'н',
  ['I'] = '1',  ['i'] = '1',
  ['J'] = 'Э',  ['j'] = 'э',
  ['K'] = 'К',  ['k'] = 'к',
  ['L'] = 'Ц',  ['l'] = '1',
  ['M'] = 'М',  ['m'] = 'м',
  ['N'] = 'И',  ['n'] = 'п',
  ['O'] = 'О',  ['o'] = 'о',
  ['P'] = 'Р',  ['p'] = 'р',
  ['Q'] = 'О',  ['q'] = '9',
  ['R'] = 'Я',  ['r'] = 'г',
  ['S'] = 'В',  ['s'] = 'в',
  ['T'] = 'Т',  ['t'] = 'т',
  ['U'] = 'Ц',  ['u'] = 'ц',
  ['V'] = 'И',  ['v'] = 'и',
  ['W'] = 'Ж',  ['w'] = 'ж',
  ['X'] = 'Х',  ['x'] = 'х',
  ['Y'] = 'У',  ['y'] = 'у',
  ['Z'] = '2',  ['z'] = '2',

  -- [[END]]

} -- GrafLatinRus

unit.GrafRusLatin = {
  -- [[DO]]

  ['1'] = 'I',  ['2'] = 'Z',
  ['3'] = '3',  ['4'] = '4',
  ['5'] = 'S',  ['6'] = 'b',
  ['7'] = 'Z',  ['8'] = 'B',
  ['9'] = 'g',  ['0'] = 'O',
  ['А'] = 'A',  ['а'] = 'a',
  ['Б'] = 'G',  ['б'] = 'b',
  ['В'] = 'B',  ['в'] = 's',
  ['Г'] = 'r',  ['г'] = 'r',
  ['Д'] = 'U',  ['д'] = 'u',
  ['Е'] = 'E',  ['е'] = 'e',
  ['Ё'] = 'E',  ['ё'] = 'e',
  ['Ж'] = 'W',  ['ж'] = 'w',
  ['З'] = '3',  ['з'] = '3',
  ['И'] = 'N',  ['и'] = 'u',
  ['Й'] = 'N',  ['й'] = 'u',
  ['К'] = 'K',  ['к'] = 'k',
  ['Л'] = 'II', ['л'] = 'n',
  ['М'] = 'M',  ['м'] = 'm',
  ['Н'] = 'H',  ['н'] = 'h',
  ['О'] = 'O',  ['о'] = 'o',
  ['П'] = 'II', ['п'] = 'n',
  ['Р'] = 'P',  ['р'] = 'p',
  ['С'] = 'C',  ['с'] = 'c',
  ['Т'] = 'T',  ['т'] = 't',
  ['У'] = 'Y',  ['у'] = 'y',
  ['Ф'] = 'G',  ['ф'] = 'g',
  ['Х'] = 'X',  ['х'] = 'x',
  ['Ц'] = 'U',  ['ц'] = 'u',
  ['Ч'] = '4',  ['ч'] = '4',
  ['Ш'] = 'III',['ш'] = 'iii',
  ['Щ'] = 'III',['щ'] = 'iii',
  ['Ъ'] = 'b',  ['ъ'] = 'b',
  ['Ы'] = 'bi', ['ы'] = 'bi',
  ['Ь'] = 'b',  ['ь'] = 'b',
  ['Э'] = 'D',  ['э'] = 'o',
  ['Ю'] = 'IO', ['ю'] = 'io',
  ['Я'] = 'R',  ['я'] = 'R',

  -- [[END]]

} -- GrafRusLatin

---------------------------------------- Char: Hanyu Pinyin <-> Palladius
do
  local konal = {
    ['B']  = 'Б',   ['P']  = 'П',  ['M']  = 'М',  ['F'] = 'Ф',
    ['D']  = 'Д',   ['T']  = 'Т',  ['N']  = 'Н',  ['L'] = 'Л',
    ['G']  = 'Г',   ['K']  = 'К',  ['H']  = 'Х',
    ['J']  = 'Цзь', ['Q']  = 'Ць', ['X']  = 'Сь',
    ['Zh'] = 'Чж',  ['Ch'] = 'Ч',  ['Sh'] = 'Ш',  ['R'] = 'Ж',
    ['Z']  = 'Цз',  ['C']  = 'Ц',  ['S']  = 'С',
  }

  local ali_final = {
                    ['ou']  = 'оу',                                    ['ong']  = 'ун',
    ['a']   = 'а',  ['ai']  = 'ай',  ['ao']  = 'ао', ['an']  = 'ань',  ['ang']  = 'ан',
    ['e']   = 'э',  ['ei']  = 'эй',  ['er']  = 'эр', ['en']  = 'энь',  ['eng']  = 'эн',
  }

  local kon_final = {
    ['o']   = 'о',

    ['u']   = 'у',  ['ui']  = 'уй',                  ['un']  = 'унь',
    ['ua']  = 'уа', ['uai'] = 'уай',                 ['uan'] = 'уань', ['uang'] = 'уан',
                    ['uei'] = 'уэй',                 ['uen'] = 'уэнь', ['ueng'] = 'уэн',
    ['uo']  = 'уо',

    ['i']   = 'и',                                   ['in']  = 'инь',  ['ing']  = 'ин',
    ['ia']  = 'я',                   ['iao'] = 'яо', ['ian'] = 'янь',  ['iang'] = 'ян',
    ['ie']  = 'е',
    ['io']  = 'ё',                                                     ['iong'] = 'юн',
    ['iu']  = 'ю',  ['ü']   = 'юй',  ['üe']  = 'юэ', ['ün']  = 'юнь',  ['üan']  = 'юaнь',
  }
  for k, v in pairs(ali_final) do kon_final[k] = v end

  local nul_final = {
    ['i']   = 'ы',
    ['wa']  = 'ва', ['wai'] = 'вай',                 ['wan'] = 'вань', ['wang'] = 'ван',
                    ['wei'] = 'вэй',                 ['wen'] = 'вэнь', ['weng'] = 'вэн',
    ['wo']  = 'во',
    ['wu']  = 'у',

    ['yi']  = 'и',                                   ['yin'] = 'инь',  ['ying'] = 'ин',
    ['ya']  = 'я',                   ['yao'] = 'яо', ['yan'] = 'янь',  ['yang'] = 'ян',
    ['ye']  = 'е',
    ['yo']  = 'ё',                                                     ['yong'] = 'юн',
    ['you'] = 'ю',  ['yu']  = 'юй',  ['yue'] = 'юэ', ['yun'] = 'юнь',  ['yuan'] = 'юaнь',
  }
  for k, v in pairs(ali_final) do nul_final[k] = v end
  local upfirst = strings.upfirst
  for k, v in pairs(nul_final) do nul_final[upfirst(k)] = upfirst(v) end

  do
    -- GlifPinyinPallad
    local t = {}
    for k, v in pairs(konal) do -- Согласные
      t[k] = v
    end

    for k, v in pairs(konal) do -- Согласные инициали
      for f, w in pairs(kon_final) do -- с финалями
        t[k..f] = v..w
      end
    end

    for f, w in pairs(nul_final) do -- Финали без инициалей
      t[f] = w
    end

    --logShow(t)

    unit.GlifPinyinPallad = t

    -- GlifPalladPinyin
    local u = {}
    for k, v in pairs(t) do
      u[v] = k
    end

    --logShow(u)

    unit.GlifPalladPinyin = u
  end
end

--------------------------------------------------------------------------------
return unit
--------------------------------------------------------------------------------
